package com.erp.common.enums;


import lombok.AllArgsConstructor;
import lombok.NoArgsConstructor;

import java.io.Serializable;

/**
 * 全局错误码定义，用于定义接口的响应数据，
 * 枚举名称全部使用代码命名，在系统中调用，免去取名难的问题。
 */
@NoArgsConstructor
@AllArgsConstructor
public enum ApiError implements Serializable {


    /**
     * 服务调用异常
     */
    Default(10000000, "操作失败！"),
    ERROR_5000(5000, "存在越权访问URL"),
    ERROR_5001(5001, "未授权访问!"),

    ERROR_403(403, "您未登录,请登录后操作"),


    /**
     * 通用错误
     */
    ERROR_500(500, "系统异常"),
    ERROR_1000(1000, "参数不全或类型错误！"),
    ERROR_1001(1001, "两次密码不一致"),
    ERROR_1002(1002, "保存失败"),
    ERROR_1003(1003, "id不能为空"),
    ERROR_1004(1004, "未授权访问！"),
    ERROR_1005(1005, "登录失败!"),
    ERROR_1006(1006, "邮箱模板不存在!"),
    ERROR_1007(1007, "邮箱验证码不正确!"),
    ERROR_1008(1008, "邮箱格式不正确!"),
    ERROR_1009(1009, "发送邮件频繁 请稍后再试!"),
    ERROR_1010(1010, "发送邮件失败!"),
    ERROR_1011(1011, "账户已禁用!"),
    ERROR_1012(1012, "Excel解析数据时发生异常"),
    ERROR_1013(1013, "您没有权限操作"),


    /**
     * 系统错误码
     * 从9010 开始  以端口号
     */
    ERROR_9010(9010, "手机号码已存在"),
    ERROR_9011(9011, "用户不存在"),
    ERROR_9012(9012, "用户不存在或者密码错误"),
    ERROR_9013(9013, "存在父级节点，无法删除"),
    ERROR_9014(9014, "核算公司不存在"),
    ERROR_9015(9015, "密码不能为空"),
    ERROR_9016(9016, "账号已禁用"),
    ERROR_9017(9017, "账号密码错误"),
    ERROR_9018(9018, "绑定账号失败"),
    ERROR_9019(9019, "账号尚未绑定请绑定后在登录"),
    ERROR_9020(9020, "改账号已经绑定"),
    ERROR_9021(9021, "角色不存在"),
    ERROR_9022(9022, "搜索类型有误"),
    ERROR_9023(9023, "部门名已存在"),
    ERROR_9024(9024, "邮箱已存在"),



    /**
     * 工作流错误
     * 从9040 开始  以端口号
     */
    ERROR_94000(94000, "流程不存在或者流程已结束"),
    ERROR_94001(94001, "流程尚未开始"),
    ERROR_94002(94002, "当前节点为空"),
    ERROR_94003(94003, "不是第一个用户任务节点无法取回"),
    ERROR_94004(94004, "启动流程失败"),




    /**
     * PLM 错误
     * 从95000 开始  以端口号
     */
    ERROR_95000(95000, "产品分类名称已存在"),
    ERROR_95001(95001, "任务阶段名已存在,不可重复提交"),
    ERROR_95002(95002, "任务阶段名不能为空"),
    ERROR_95003(95003, "文档名称已存在，不可重复提交"),
    ERROR_95004(95004, "字段名已存在，不可重复提交"),
    ERROR_95005(95005, "分类下存在子分类，不可删除"),
    ERROR_95006(95006, "分类下存在产品，请调整分类后删除"),
    ERROR_95007(95007, "产品名称已存在，不可重复提交"),
    ERROR_95008(95008, "立项阶段名不可更改"),
    ERROR_95009(95009, "产品名不一致 无法删除"),
    ERROR_95010(95010, "产品不存在"),
    ERROR_95011(95011, "模板名已存在,不可重复提交"),
    ERROR_95012(95012, "文档名已存在,不可重复提交"),
    ERROR_95013(95013, "任务名已存在,不可重复提交"),
    ERROR_95014(95014, "固定任务不能删除"),
    ERROR_95015(95015, "SKU已存在，请确保SKU的唯一性"),
    ERROR_95016(95016, "项目角色名已存在，不可重复提交"),
    ERROR_95017(95017, "SPU已存在，请确保SPU的唯一性"),
    ERROR_95018(95018, "上传文件失败"),
    ERROR_95019(95019, "项目尚未完成，不可归档"),
    ERROR_95020(95020, "立项阶段名不能删除"),
    ERROR_95021(95021, "该成员已有该角色"),
    ERROR_95022(95022, "该项目已有该字段"),
    ERROR_95023(95023, "同一个变体类型的变体值，不可重复"),
    ERROR_95024(95024, "该任务存在子任务,不能删除"),
    ERROR_95025(95025, "产品分类不存在"),
    ERROR_95026(95026, "项目不存在"),
    ERROR_95027(95027, "任务不存在"),
    ERROR_95028(95028, "已上传的文档不存在"),
    ERROR_95029(95029, "存在多个任务状态不可批量操作"),

    ERROR_95030(95030, "只有待发布才可操作发布任务"),
    ERROR_95031(95031, "只有待开始，待审核任务才可操作取消发布"),
    ERROR_95032(95032, "只有待开始，才可操作开始任务"),
    ERROR_95033(95033, "只有进行中的任务,才可操作关闭任务"),
    ERROR_95034(95034, "评审任务不可操作完成任务"),
    ERROR_95035(95035, "操作失败，前置任务有未完成的任务"),
    ERROR_95036(95036, "操作失败，子任务有未完成的任务"),
    ERROR_95037(95037, "操作失败，存在不是待审核的任务"),
    ERROR_95038(95038, "只有待审核任务和审核中才可操作 审核任务"),
    ERROR_95039(95039, "任务未完成 不能变更文档"),
    ERROR_95040(95040, "审核已通过不能删除文档"),
    ERROR_95041(95041, "任务阶段不存在"),
    ERROR_95042(95042, "立项阶段不能删除"),
    ERROR_95043(95043, "该阶段下已有任务不能删除"),
    ERROR_95044(95044, "只有进行中的任务,才可操作完成任务"),
    ERROR_95045(95045, "审核人为空，请先配置任务审核人"),
    ERROR_95046(95046, "只有审核中和完成待审核的任务,才可操作审核不通过"),
    ERROR_95047(95047, "操作失败,不能完成任务，存在未上传的文件"),
    ERROR_95048(95048, "该阶段下已有任务不能删除"),
    ERROR_95049(95049, "您无权操作，不是您审核的任务"),
    ERROR_95050(95050, "操作失败，有未完成的任务"),
    ERROR_95051(95051, "模板不存在"),






    ERROR_end(1000000, "系统错误");

    public Integer code;
    public String msg;


}
