package com.erp.common.enums;


import lombok.AllArgsConstructor;
import lombok.NoArgsConstructor;

import java.io.Serializable;

/**
 * 全局错误码定义，用于定义接口的响应数据，
 * 枚举名称全部使用代码命名，在系统中调用，免去取名难的问题。
 */
@NoArgsConstructor
@AllArgsConstructor
public enum ApiError implements Serializable {


    /**
     * 服务调用异常
     */
    Default(10000000, "操作失败！"),
    ERROR_5000(5000, "存在越权访问URL"),
    ERROR_5001(5001, "未授权访问!"),

    ERROR_403(403, "您未登录,请登录后操作"),




    /**
     * 通用错误
     */
    ERROR_500(500, "系统异常"),
    ERROR_1000(1000, "参数不全或类型错误！"),
    ERROR_1001(1001, "两次密码不一致"),
    ERROR_1002(1002, "保存失败"),
    ERROR_1003(1003, "id不能为空"),
    ERROR_1004(1004, "未授权访问！"),
    ERROR_1005(1005, "登录失败!"),
    ERROR_1006(1006, "邮箱模板不存在!"),
    ERROR_1007(1007, "邮箱验证码不正确!"),
    ERROR_1008(1008, "邮箱格式不正确!"),
    ERROR_1009(1009, "发送邮件频繁 请稍后再试!"),
    ERROR_1010(1010, "发送邮件失败!"),
    ERROR_1011(1011, "账户已禁用!"),
    ERROR_1012(1012, "Excel解析数据时发生异常"),
    ERROR_1013(1013, "您没有权限操作"),
    ERROR_1014(1014, "请勿重复操作"),

    /**
     * 警告信息 从800 开始
     */
    ERROR_800(800,"存在[%s]尚未填写完成，是否确认提交"),

    /**
     * 系统错误码
     * 从9010 开始  以端口号
     */
    ERROR_9010(9010, "手机号码已存在"),
    ERROR_9011(9011, "用户不存在"),
    ERROR_9012(9012, "用户不存在或者密码错误"),
    ERROR_9013(9013, "存在父级节点，无法删除"),
    ERROR_9014(9014, "核算公司不存在"),
    ERROR_9015(9015, "密码不能为空"),
    ERROR_9016(9016, "账号已禁用"),
    ERROR_9017(9017, "账号密码错误"),
    ERROR_9018(9018, "绑定账号失败"),
    ERROR_9019(9019, "账号尚未绑定请绑定后在登录"),
    ERROR_9020(9020, "改账号已经绑定"),
    ERROR_9021(9021, "角色不存在"),
    ERROR_9022(9022, "搜索类型有误"),
    ERROR_9023(9023, "部门名已存在"),
    ERROR_9024(9024, "邮箱已存在"),
    ERROR_9025(9025, "角色名已存在"),
    ERROR_9026(9026, "系统编号类型已存在"),
    ERROR_9027(9027, "生成编号失败"),
    ERROR_9028(9028, "未找到对应的枚举"),


    /**
     * 工作流错误
     * 从9040 开始  以端口号
     */
    ERROR_94000(94000, "流程不存在或者流程已结束"),
    ERROR_94001(94001, "流程尚未开始"),
    ERROR_94002(94002, "当前节点为空"),
    ERROR_94003(94003, "不是第一个用户任务节点无法取回"),
    ERROR_94004(94004, "启动流程失败"),




    /**
     * PLM 错误
     * 从95000 开始  以端口号
     */
    ERROR_95000(95000, "产品分类名称已存在"),
    ERROR_95001(95001, "任务阶段名已存在,不可重复提交"),
    ERROR_95002(95002, "任务阶段名不能为空"),
    ERROR_95003(95003, "文档名称已存在，不可重复提交"),
    ERROR_95004(95004, "字段名已存在，不可重复提交"),
    ERROR_95005(95005, "分类下存在子分类，不可删除"),
    ERROR_95006(95006, "分类下存在产品，请调整分类后删除"),
    ERROR_95007(95007, "产品名称已存在，不可重复提交"),
    ERROR_95008(95008, "立项阶段名不可更改"),
    ERROR_95009(95009, "产品名不一致 无法删除"),
    ERROR_95010(95010, "产品不存在"),
    ERROR_95011(95011, "模板名已存在,不可重复提交"),
    ERROR_95012(95012, "文档名已存在,不可重复提交"),
    ERROR_95013(95013, "任务名已存在,不可重复提交"),
    ERROR_95014(95014, "固定任务不能删除"),
    ERROR_95015(95015, "SKU已存在，请确保SKU的唯一性"),
    ERROR_95016(95016, "项目角色名已存在，不可重复提交"),
    ERROR_95017(95017, "SPU已存在，请确保SPU的唯一性"),
    ERROR_95018(95018, "上传文件失败"),
    ERROR_95019(95019, "项目尚未完成，不可归档"),
    ERROR_95020(95020, "立项阶段名不能删除"),
    ERROR_95021(95021, "成员列表中已有该角色"),
    ERROR_95022(95022, "该项目已有该字段"),
    ERROR_95023(95023, "同一个变体类型的变体值，不可重复"),
    ERROR_95024(95024, "该任务存在子任务,不能删除"),
    ERROR_95025(95025, "产品分类不存在"),
    ERROR_95026(95026, "项目不存在"),
    ERROR_95027(95027, "任务不存在"),
    ERROR_95028(95028, "已上传的文档不存在"),
    ERROR_95029(95029, "存在多个任务状态不可批量操作"),

    ERROR_95030(95030, "只有待发布才可操作发布任务"),
    ERROR_95031(95031, "只有待开始，待审核任务才可操作取消发布"),
    ERROR_95032(95032, "只有待开始或者关闭，才可操作开始任务"),
    ERROR_95033(95033, "只有进行中的任务,才可操作关闭任务"),
    ERROR_95034(95034, "评审任务不可操作完成任务"),
    ERROR_95035(95035, "操作失败，前置任务有未完成的任务"),
    ERROR_95036(95036, "操作失败，子任务有未完成的任务"),
    ERROR_95037(95037, "操作失败，存在不是待审核的任务"),
    ERROR_95038(95038, "只有待审核任务和审核中才可操作 审核任务"),
    ERROR_95039(95039, "任务未完成 不能变更文档"),
    ERROR_95040(95040, "审核已通过不能删除文档"),
    ERROR_95041(95041, "任务阶段不存在"),
    ERROR_95042(95042, "立项阶段不能删除"),
    ERROR_95043(95043, "该阶段下已有任务不能删除"),
    ERROR_95044(95044, "只有进行中的任务,才可操作完成任务"),
    ERROR_95045(95045, "审核人为空，请先配置任务审核人"),
    ERROR_95046(95046, "只有审核中和完成待审核的任务,才可操作审核不通过"),
    ERROR_95047(95047, "存在输出物尚未完成,请完成后在操作"),
    ERROR_95048(95048, "该阶段下已有任务不能删除"),
    ERROR_95049(95049, "您无权操作，不是您审核的任务"),
    ERROR_95050(95050, "操作失败，有未完成的任务"),
    ERROR_95051(95051, "模板不存在"),
    ERROR_95052(95052, "文档不存在"),
    ERROR_95053(95053, "通知节点已使用"),
    ERROR_95054(95054, "通知节点不存在"),
    ERROR_95055(95055, "项目人员/其他人员必须填写一个"),
    ERROR_95056(95056, "尚未绑定飞书，请在ERP系统[个人中心]绑定飞书后可查看通知"),
    ERROR_95057(95057, "该模板下已存在相同任务名称，不可重复提交"),
    ERROR_95058(95058, "模板任务不存在"),
    ERROR_95059(95059, "模板下已存在该角色"),
    ERROR_95060(95060, "请选择模板成员"),
    ERROR_95061(95061, "模板角色下已存在该成员"),
    ERROR_95062(95062, "unionId不能为空"),
    ERROR_95063(95063, "立项模板已存在"),
    ERROR_95064(95064, "项目默认模板已存在"),
    ERROR_95065(95065, "任务名不能超过50字符"),
    ERROR_95066(95066, "只有审核不通过的任务,才可操作重新开始"),
    ERROR_95067(95067, "尚未生成SKU，请在立项阶段生成SKU后启动"),
    ERROR_95068(95068, "配置的审核人有误"),
    ERROR_95069(95069, "产品分类编码不能为空"),
    ERROR_95070(95070, "产品分类编码已存在"),
    ERROR_95071(95071, "产品分类编码范围在A-Z区间"),
    ERROR_95072(95072, "产品分类不存在"),
    ERROR_95073(95073, "产品销售渠道不能为空"),
    ERROR_95074(95074, "未找到SKU变体颜色信息"),
    ERROR_95075(95075, "任务视图导出类型必填"),
    ERROR_95076(95076, "保存任务失败,该产品已归档或该项目已归档"),
    ERROR_95077(95077, "完成任务失败,产品信息尚未填写"),
    ERROR_95078(95078, "存在配置表单，请在[设置文档]中添加审核流程"),
    ERROR_95079(95079, "变体信息为空"),
    ERROR_95080(95080, "变体颜色信息为空"),
    ERROR_95081(95081, "变体颜色属性值为空"),
    ERROR_95082(95082,"产品信息未设置审核人，不支持新增或审核"),
    ERROR_95083(95083,"SKU关联任务未完成，不支持审核"),
    ERROR_95084(95084,"产品信息不存在"),
    ERROR_95085(95085,"SKU关联任务未完成，不支持申请变更"),
    ERROR_95086(95086,"SKU未审核通过，不支持申请变更"),
    ERROR_95087(95087,"SKU未审核通过，不支持反审核"),
    ERROR_95088(95088,"SKU非待审核状态，不支持重启审核流程"),
    ERROR_95089(95089,"字段名称未设置不能新增操作日志"),


    /**
     * bi 错误
     * 从97000 开始  以端口号
     */
    ERROR_97000(97000,"专题不能为空"),
    ERROR_97001(97001,"仪表盘名称不能重复"),
    ERROR_97002(97002,"不能设置非自己创建的仪表盘"),
    ERROR_97003(97003,"模块名称不能重复"),
    ERROR_97004(97004,"模块不能为空"),



    ERROR_end(1000000, "系统错误");

    public Integer code;
    public String msg;


}
