package com.erp.model.dmp.enums;

import java.util.Arrays;

/**
 *
 *
 * @Author Cloud
 * @Date 2023/3/27 17:37
 **/
public enum WdtSourcePlatformEnum {
	wdt1("0","线下"),
	wdt2("1","淘宝"),
	wdt3("2","淘宝分销"),
	wdt4("3","京东"),
	wdt5("4","拍拍"),
	wdt6("5","亚马逊"),
	wdt7("6","1号店"),
	wdt8("7","当当网"),
	wdt9("8","国美"),
	wdt10("9","阿里巴巴"),
	wdt11("10","ECShop"),
	wdt12("11","麦考林"),
	wdt13("12","V+"),
	wdt14("13","苏宁"),
	wdt15("14","唯品会"),
	wdt16("15","易迅"),
	wdt17("16","聚美"),
	wdt18("17","有赞(口袋通)"),
	wdt19("18","Hishop"),
	wdt20("19","慧策产品"),
	wdt21("20","美丽说"),
	wdt22("21","蘑菇街"),
	wdt23("22","贝贝网"),
	wdt24("23","ECstore"),
	wdt25("24","折800"),
	wdt26("25","融e购"),
	wdt27("26","穿衣助手"),
	wdt28("27","楚楚街"),
	wdt29("28","微盟"),
	wdt30("29","卷皮网"),
	wdt31("30","顺丰嘿客"),
	wdt32("32","微店"),
	wdt33("33","百度mall"),
	wdt34("34","蜜芽"),
	wdt35("35","明星衣橱"),
	wdt36("36","善融商城"),
	wdt37("37","速卖通"),
	wdt38("38","萌店"),
	wdt39("39","拼多多"),
	wdt40("40","京东到家"),
	wdt41("41","百度外卖"),
	wdt42("42","美团外卖"),
	wdt43("45","饿了么"),
	wdt44("46","我买网"),
	wdt45("47","人人店"),
	wdt46("48","美囤妈妈（宝宝树）"),
	wdt47("49","91拼团"),
	wdt48("50","考拉海购"),
	wdt49("51","千米网"),
	wdt50("52","特奢汇"),
	wdt51("53","楚楚街拼团"),
	wdt52("55","孩子王"),
	wdt53("56","小红书"),
	wdt54("57","格格家"),
	wdt55("58","云集"),
	wdt56("59","楚楚通"),
	wdt57("60","返利网"),
	wdt58("61","酒仙网"),
	wdt59("62","平安好医生"),
	wdt60("63","下厨房"),
	wdt61("64","好食期"),
	wdt62("65","大V店"),
	wdt63("66","好衣库（鲸灵）"),
	wdt64("67","达令家"),
	wdt65("68","爱库存"),
	wdt66("69","抖店（放心购）"),
	wdt67("70","每日一淘"),
	wdt68("71","贝壳优品"),
	wdt69("72","小米有品"),
	wdt70("73","未来集市"),
	wdt71("74","爱奇艺商城"),
	wdt72("75","快手小店"),
	wdt73("76","魔筷星选"),
	wdt74("77","海拍客"),
	wdt75("78","壹钱包"),
	wdt76("79","每日优鲜"),
	wdt77("80","网易严选"),
	wdt78("81","多点"),
	wdt79("82","天猫超市一盘货"),
	wdt80("83","微信视频号"),
	wdt81("84","娇兰佳人"),
	wdt82("85","途虎养车"),
	wdt83("86","今日爆团"),
	wdt84("87","阿里健康大药房"),
	wdt85("88","必要"),
	wdt86("89","腾讯枫页"),
	wdt87("90","微信小商店"),
	wdt88("91","快手金牛 "),
	wdt89("92","摩点 "),
	wdt90("93","易订货"),
	wdt91("94","天猫国际直营（轻轨三号线）"),
	wdt92("96","驿氪"),
	wdt93("97","妈妈良品"),
	wdt94("98","小芒电商"),
	wdt95("99","卡美啦"),
	wdt96("100","年丰大当家"),
	wdt97("101","得物"),
	wdt98("102","考拉商家直发"),
	wdt99("103","美团闪购"),
	wdt100("104","新华书店"),
	wdt101("105","云货优选"),
	wdt102("106","零售通"),
	wdt103("107","易久批"),
	wdt104("108","腾讯惠聚"),
	wdt105("109","小鹅拼拼"),
	wdt106("110","度小店"),
	wdt107("111","枫页小店"),
	wdt108("112","丁香妈妈"),
	wdt109("113","药师帮"),
	wdt110("114","峰雷"),
	wdt111("115","SHEIN希音"),
	wdt112("116","bilibili会员购"),
	wdt113("117","群接龙"),
	wdt114("118","招商银行掌上生活"),
	wdt115("119","华为商城"),
	wdt116("120","微信连接器"),
	wdt117("121","单创VTN"),
	wdt118("122","天虹商城"),
	wdt119("123","有路网"),
	wdt120("125","分销"),
	wdt121("126","定制"),
	wdt122("128","猫享-考拉自营"),
	wdt123("131","B+"),
	wdt124("134","闲鱼"),
	wdt125("135","小亚通"),
	wdt126("136","百度营销2.0/百度优选"),
	wdt127("137","淘宝代打代发"),
	wdt128("138","震坤行"),
	wdt129("139","抖音供销"),
	wdt130("140","顺联动力"),
	wdt131("141","行云货仓"),
	wdt132("142","喵街"),
	wdt133("146","百度健康"),
	wdt134("148","微博电商"),
	wdt135("150","微商相册"),
	wdt136("151","禾量"),
	wdt137("152","花城农夫"),
	wdt138("154","抖音超市"),
	wdt139("159","美团闪电仓"),
	wdt140("164","翼支付"),
	wdt141("165","本来生活"),
	wdt142("166","书链通"),
	wdt143("168","达摩"),
	wdt144("169","东方甄选"),
	wdt145("171","一商创信私域"),
	wdt146("172","淘宝买菜"),
	wdt147("173","盒马云超"),
	wdt148("174","聚好麦"),
	wdt149("176","大师熊"),
	wdt150("177","药九九"),
	wdt151("179","梵蜜琳"),
	wdt152("182","秉坤"),
	wdt153("192","星妈优选"),
	wdt154("199","好又多"),
    ;

    private final String code;
    private final String name;

    WdtSourcePlatformEnum(String code, String name) {
        this.code = code;
        this.name = name;
    }

    public String getCode() {
        return code;
    }


    public String getName() {
        return name;
    }

    public static WdtSourcePlatformEnum getByCode(String code) {
        return Arrays.stream(WdtSourcePlatformEnum.values())
                .filter(platform -> platform.getCode().equals(code))
                .findFirst()
                .orElse(null);
    }

    public static WdtSourcePlatformEnum getByName(String name) {
        return Arrays.stream(WdtSourcePlatformEnum.values())
                .filter(platform -> platform.getName().equals(name))
                .findFirst()
                .orElse(null);
    }
}
